# Visibility Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
GeometryObject..::..Visibility Property
GeometryObject Class See Also
---
The visibility.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Visibility Visibility { get; set; }
```

Visual Basic
---
```text
Public Property Visibility As Visibility
	Get
	Set
```

Visual C++
---
```text
public:
property Visibility Visibility {
	Visibility get ();
	void set (Visibility value);
}
```

# Remarks
The visibility of this object has no effect on the visibility of objects contained within this object. For example, the visibility of a Solid may be Contextual but the faces within that solid may still be Visible.
# See Also
GeometryObject Class
Autodesk.Revit.DB Namespace